src/Catalogs/КлассификаторНоменклатурыМедицинскихУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторНоменклатурыМедицинскихУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОнлайнЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОнлайнЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНоменклатурыМедицинскиУслуг</Name>
					<Comment>Код услуги (Приказ МЗ РФ от 13.10.2017г. №804Н)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМедицинскихУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНоменклатурыМедицинскихУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменССайтомСоответствиеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноУказаниеАссистента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписиAPI</Name>
					<Comment>Описание, которое отдаем в API, для выгрузки нам нужно только body, что бы в API не терять из-за обрезки время, добавили доп. реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатМногоразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкиЗапрещены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация для номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаДляОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗапас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИменнойСертификат</Name>
					<Comment>Это именной сертификат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИмущество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПодарочныйСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиЗубнойФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СостояниеЗубнойФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостояниеЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СННоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КлассификаторНоменклатурыМедицинскихУслуг/Forms/ФормаПодбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗагрузитьКлассификатор.Видимость = Не ОбщегоНазначения.РазделениеВключено();
	Элементы.ЗагрузитьКлассификатор.ТолькоВоВсехДействиях = Истина;
	ПодборОтображитьДеревом                   = Истина;
	СоздатьДеревоУслуг();
	УстановитьУсловноеОформление();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - Сохранить
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура Сохранить(Команда)
		
	Ссылки = Новый Массив;
	Для Каждого СтрокаТЧ Из ТаблицаКлассификаторУслуг Цикл
		Ссылки.Добавить(СтрокаТЧ.Услуга);		
	КонецЦикла;
	
	Если Ссылки.Количество() > 0 Тогда
		
		МассивУслуг = ОбработатьВыборНаСервере(Ссылки, Группа);
		Количество = МассивУслуг.Количество();
		Оповестить("ОбновитьПослеДобавления");
		Если Количество = 0 Тогда
			Описание = "Услуги не загружены. Необходимо выбрать загружаемые услуги.";
		Иначе
			Описание = "Загружено " + Количество + " услуг в справочник Номенклатура.";
		КонецЕсли;		
		ПоказатьОповещениеПользователя("Загрузка услуг",,Описание, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 		
	КонецЕсли;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

// Процедура - Загрузить классификатор
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	
	РезультатЗагрузки = ДобавитьИзКлассификатораНаСервере();
	Описание = "В классификатор загружено " + РезультатЗагрузки.КолличествоЗагружено + " услуг." + 
		?(РезультатЗагрузки.КолличествоОбновлено <> 0, " Обновлено " + РезультатЗагрузки.КолличествоОбновлено + ".", "");
	
	ПоказатьОповещениеПользователя("Загрузка классификатора услуг",, Описание, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
	ОбновитьДеревоУслуг();
	
КонецПроцедуры

// Процедура - Выбрать строки
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	
	ОтметитьУслуги(1);

КонецПроцедуры

// Процедура - Исключить строки
//
// Параметры:
//  Команда	 - 	 - 
//
&НаКлиенте
Процедура ИсключитьСтроки(Команда)
	
	 ОтметитьУслуги(0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, выполянет создание дерева услуг.
//
Процедура СоздатьДеревоУслуг()
	
	ИмяЭлементаДляРазмещения = "ГруппаДеревоКлассификаторУслуг";
	масРеквизитов = Новый Массив;		
	
	ИмяДерева = "_ПодборКлассификаторУслуг";
	
	МассивДопустимыхТипов = Новый Массив;
	МассивДопустимыхТипов.Добавить(Тип("СправочникСсылка.КлассификаторНоменклатурыМедицинскихУслуг"));
	МассивДопустимыхТипов.Добавить(Тип("Строка"));
	
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ДеревоЗначений"), , "Подбор номенклатур", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Услуга"	   			   , Новый ОписаниеТипов(МассивДопустимыхТипов), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("КодУслуги"	           , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("УЕТ"	               , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Выбран"				   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Наименование"	       , Новый ОписаниеТипов("Строка"), ИмяДерева));
	
	масРеквизитов.Добавить(Новый РеквизитФормы("_ПодборКлассификаторУслугИсточникГрупп", Новый ОписаниеТипов("ДеревоЗначений"), , "Услуги подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Услуга"				   , Новый ОписаниеТипов("СправочникСсылка.КлассификаторНоменклатурыМедицинскихУслуг"), "_ПодборКлассификаторУслугИсточникГрупп"));
	
	ИмяДерева = "_ПодборКлассификаторУслугИсточникЭлементов";
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ТаблицаЗначений"), , "Услуги подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Услуга"	               , Новый ОписаниеТипов("СправочникСсылка.КлассификаторНоменклатурыМедицинскихУслуг"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Родитель"		       , Новый ОписаниеТипов("СправочникСсылка.КлассификаторНоменклатурыМедицинскихУслуг"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Наименование"	       , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("КодУслуги"	           , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Выбран"				   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("УЕТ"	               , Новый ОписаниеТипов("Строка"), ИмяДерева));
			
	ИзменитьРеквизиты(масРеквизитов);	
	
	ЭлементДерево = Элементы.Добавить("_ПодборКлассификаторУслуг", Тип("ТаблицаФормы"), Элементы[ИмяЭлементаДляРазмещения]);
	ЭлементДерево.ПутьКДанным 				 = "_ПодборКлассификаторУслуг";
	ЭлементДерево.Отображение 				 = ОтображениеТаблицы.Дерево;
	ЭлементДерево.КартинкаСтрок 			 = БиблиотекаКартинок.ТерминалПодбор; 
	ЭлементДерево.ПутьКДаннымКартинкиСтроки  = "_ПодборКлассификаторУслуг.ИндКартинки";
	ЭлементДерево.ПоложениеКоманднойПанели   = ПоложениеКоманднойПанелиЭлементаФормы.Нет;	
	ЭлементДерево.АвтоМаксимальнаяШирина 	 = Ложь;
	ЭлементДерево.РастягиватьПоГоризонтали	 = Истина;
	ЭлементДерево.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	ЭлементДерево.ПоложениеСтрокиПоиска      = ПоложениеСтрокиПоиска.Верх;
	ЭлементДерево.ПоложениеУправленияПоиском = ПоложениеУправленияПоиском.Нет;

	НовыйЭлемент = Элементы.Добавить("Выбран", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид					 = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным			 = "_ПодборКлассификаторУслуг.Выбран";
	НовыйЭлемент.ТриСостояния			 = Истина;
	НовыйЭлемент.ЦветФонаЗаголовка	 	 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ПоложениеЗаголовка      = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодборКлассификаторУслугПриИзменении");

	НовыйЭлемент = Элементы.Добавить("КодУслуги", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид		 				 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным				 = "_ПодборКлассификаторУслуг.КодУслуги";
	НовыйЭлемент.Ширина 					 = 8;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 8;
	НовыйЭлемент.РастягиватьПоГоризонтали	 = Ложь;	
	НовыйЭлемент.Заголовок					 = "Код";
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ТолькоПросмотр              = Истина;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Услуга", Тип("ПолеФормы"), ЭлементДерево);	
	НовыйЭлемент.Вид 		 			 	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 60;
	НовыйЭлемент.ТолькоПросмотр 		 	 = Истина;
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ПутьКДанным				 = "_ПодборКлассификаторУслуг.Услуга";
		
	НовыйЭлемент = Элементы.Добавить("НормаВремени", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид		 				 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным				 = "_ПодборКлассификаторУслуг.НормаВремени";
	НовыйЭлемент.Ширина 					 = 8;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 8;
	НовыйЭлемент.РастягиватьПоГоризонтали	 = Ложь;	
	НовыйЭлемент.Заголовок					 = "Норма времени";
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ТолькоПросмотр              = Истина;
	
	НовыйЭлемент = Элементы.Добавить("УЕТ", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид		 				 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным				 = "_ПодборКлассификаторУслуг.УЕТ";
	НовыйЭлемент.Ширина 					 = 8;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 8;
	НовыйЭлемент.РастягиватьПоГоризонтали	 = Ложь;	
	НовыйЭлемент.Заголовок					 = "УЕТ";
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ТолькоПросмотр              = Истина;

	ЗаполнитьДеревоПодбораКлассификатора();
	
	ЗаполнитьСписокПодбораРекурсивноСервер(
		ЭтаФорма._ПодборКлассификаторУслугИсточникГрупп.ПолучитьЭлементы(), 
		ЭтаФорма._ПодборКлассификаторУслугИсточникЭлементов, 
		ЭтаФорма._ПодборКлассификаторУслуг, ЭтаФорма);		
		
	ЗаполнитьСуществующиеУслуги();
	
КонецПроцедуры

&НаСервере
// Процедура, выполянет создание дерева услуг.
//
Процедура ОбновитьДеревоУслуг()
	
	ЗаполнитьДеревоПодбораКлассификатора();
	
	ЗаполнитьСписокПодбораРекурсивноСервер(
		ЭтаФорма._ПодборКлассификаторУслугИсточникГрупп.ПолучитьЭлементы(), 
		ЭтаФорма._ПодборКлассификаторУслугИсточникЭлементов, 
		ЭтаФорма._ПодборКлассификаторУслуг, ЭтаФорма);		
		
	ЗаполнитьСуществующиеУслуги();

КонецПроцедуры

&НаСервере
// Процедура, заполняет источник групп
//
Процедура ЗаполнитьИсточникГрупп(ВыборкаГрупп, УровеньЗаполнения)
	
	Для Каждого УровеньОбхода Из ВыборкаГрупп.Строки Цикл
		НоваяСтрока = УровеньЗаполнения.Добавить();
		ЗаполнитьИсточникГрупп(УровеньОбхода, НоваяСтрока.ПолучитьЭлементы());
		НоваяСтрока.Услуга = УровеньОбхода.Ссылка;                          
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение подбора классификатора 
//
Процедура ЗаполнитьДеревоПодбораКлассификатора()
	
	ЗапросГрупп = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникКлассификаторУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторНоменклатурыМедицинскихУслуг КАК СправочникКлассификаторУслуг
	|ГДЕ
	|	СправочникКлассификаторУслуг.ЭтоГруппа = ИСТИНА
	|	И СправочникКлассификаторУслуг.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");	
	
	ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	ЭтаФорма._ПодборКлассификаторУслугИсточникГрупп.ПолучитьЭлементы().Очистить();	
	
	ЗаполнитьИсточникГрупп(ВыборкаГрупп, ЭтаФорма._ПодборКлассификаторУслугИсточникГрупп.ПолучитьЭлементы());	
	ПустаяГруппа = ЭтаФорма._ПодборКлассификаторУслугИсточникГрупп.ПолучитьЭлементы().Добавить();
	
	ЗапросУслуг = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрКлассификаторУслуг.Ссылка КАК Услуга,
	|	СпрКлассификаторУслуг.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА СпрКлассификаторУслуг.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СпрКлассификаторУслуг.Родитель КАК Родитель,
	|	СпрКлассификаторУслуг.Наименование КАК Наименование,
	|	СпрКлассификаторУслуг.НормаВремени КАК НормаВремени,
	|	СпрКлассификаторУслуг.Код КАК КодУслуги,
	|	СпрКлассификаторУслуг.УЕТ КАК УЕТ
	|ИЗ
	|	Справочник.КлассификаторНоменклатурыМедицинскихУслуг КАК СпрКлассификаторУслуг
	|ГДЕ
	|	НЕ СпрКлассификаторУслуг.ПометкаУдаления
	|	И НЕ СпрКлассификаторУслуг.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|ИТОГИ
	|	МАКСИМУМ(ЭтоГруппа),
	|	МАКСИМУМ(ИндКартинки),
	|	МАКСИМУМ(Родитель),
	|	МАКСИМУМ(Наименование)
	|ПО
	|	Услуга");
	
	ВыборкаУслуг = ЗапросУслуг.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭтаФорма._ПодборКлассификаторУслугИсточникЭлементов.Очистить();
	
	Пока ВыборкаУслуг.Следующий() Цикл
		
		СтрокаТЧ = ЭтаФорма._ПодборКлассификаторУслугИсточникЭлементов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаУслуг);
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура рекурсивного заолнения дерева подбора номенклатур
//
Процедура ЗаполнитьСписокПодбораРекурсивноСервер(ИсточникГрупп, ИсточникУслуг, ЭлементЗаполнения, Форма)
	
	Если ПодборОтображитьДеревом Тогда 
		
		Для Каждого УровеньЗаполнения Из ИсточникГрупп Цикл	
			
			Если ЗначениеЗаполнено(УровеньЗаполнения.Услуга) Тогда 
				НоваяСтрокаГруппы		 	= ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.Услуга 	= УровеньЗаполнения.Услуга;		
				НоваяСтрокаГруппы.ЭтоГруппа = Истина;				
			Иначе 
				НоваяСтрокаГруппы = Форма._ПодборКлассификаторУслуг; 				
			КонецЕсли;
			
			ЗаполнитьСписокПодбораРекурсивноСервер(УровеньЗаполнения.ПолучитьЭлементы(), ИсточникУслуг, НоваяСтрокаГруппы, Форма);						
			УслугиПоРодителю = Форма._ПодборКлассификаторУслугИсточникЭлементов.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Услуга));	
			
			// Заполняем услуги
			Для Каждого СтрокаН Из УслугиПоРодителю Цикл
					
				НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаН);
				
			КонецЦикла;	
			
			// Удаляем узел группы если он не содержит элементы
			Если НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 
				И Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДанныеФормыДерево") Тогда
				ЭлементЗаполнения.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
			КонецЕсли;	
			
		КонецЦикла;	
	Иначе
		
		ЭлементыЗаполнения = ЭлементЗаполнения.ПолучитьЭлементы();
		
		Для Каждого УровеньЗаполнения Из ИсточникУслуг Цикл
			
			НоваяСтрока = ЭлементыЗаполнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, УровеньЗаполнения);
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура Подключаемый_ПодборКлассификаторУслугПриИзменении(Элемент)
	
	ИмяКолонки = Элемент.Имя;
	ТекущиеДанные = Элементы._ПодборКлассификаторУслуг.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоГруппа Тогда                      		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли; 
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки);
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, Истина);
	Иначе
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли;		
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки);			
	КонецЕсли;
	
	ТаблицаКлассификаторУслуг.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборКлассификаторУслуг.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
// Процедура, выполняет установку флагов на элменеты.
//
Процедура УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки, Установить = Неопределено)
	
	Если Установить = Неопределено Тогда
		Флаг = ТекущиеДанные[ИмяКолонки];
	Иначе
		Флаг = Установить;
	КонецЕсли;

	Если СуществующиеУслуги.НайтиПоЗначению(ТекущиеДанные.Услуга) = Неопределено Тогда
		ТекущиеДанные[ИмяКолонки] = Установить;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает флаги на группы.
//
Процедура УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, ЭтоРодитель = Ложь)
	
	Если ЭтоРодитель Тогда
		Родитель = ТекущиеДанные;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		Если СтрокаДерева[ИмяКолонки] = 1 Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		ИначеЕсли СтрокаДерева[ИмяКолонки] = 2 Тогда
			КоличествоВыбранных = -1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонки] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонки] = 0;
	Иначе
		Родитель[ИмяКолонки] = 2;
	КонецЕсли;		
	
	УстановитьФлагиНаГруппы(Родитель, ИмяКолонки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение таблицы номенклатруры.
//
Процедура ЗаполнитьТаблицуНоменклатуры(Родитель) 
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();	
	
	Для Каждого СтрокаДерева из ДанныеДерева Цикл		
		Если СтрокаДерева.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаДерева);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаДерева);	
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение строки таблицы.
//
Процедура ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаДерева)
	
	Если СтрокаДерева["Выбран"] Тогда
		НоваяСтрока				 = ТаблицаКлассификаторУслуг.Добавить();
		НоваяСтрока.Услуга       = СтрокаДерева.Услуга;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработатьВыборНаСервере(Ссылки, Группа)
	
	Количество = РаботаСКлассификаторамиПереопределяемый.ПодобратьУслугиИзКлассификатора(Ссылки, Группа);
	Возврат Количество;
	
КонецФункции

&НаСервере
// Процедура, выполняет установку условного оформления.
//
Процедура УстановитьУсловноеОформление()
		
	ЭлементУФ					 = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	ЭлементОтбора                = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборКлассификаторУслуг.Услуга");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СуществующиеУслуги;                                              
	ЭлементОтбора.Использование  = Истина;	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Доступность"), Ложь);
	
	ПолеОформления               = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("Выбран");
	ПолеОформления.Использование = Истина; 

	ЭлементУФ					 = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	ЭлементОтбора                = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборКлассификаторУслуг.ЭтоГруппа");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование  = Истина;	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветФона"), Новый Цвет(245,245,245));
	
	ПолеОформления               = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("_ПодборКлассификаторУслуг");
	ПолеОформления.Использование = Истина; 

	ЭлементУФ					 = ЭтаФорма.УсловноеОформление.Элементы.Добавить();	
	ЭлементОтбора                = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("_ПодборКлассификаторУслуг.Услуга");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СуществующиеУслуги;                                              
	ЭлементОтбора.Использование  = Истина;	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), WebЦвета.СветлоСерый);
		
	ПолеОформления               = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле          = Новый ПолеКомпоновкиДанных("_ПодборКлассификаторУслуг");
	ПолеОформления.Использование = Истина; 

КонецПроцедуры

&НаСервере
// Процедура - Заполнить существующие услуги
//
Процедура ЗаполнитьСуществующиеУслуги()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлассификаторНоменклатурыМедицинскихУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторНоменклатурыМедицинскихУслуг КАК КлассификаторНоменклатурыМедицинскихУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО КлассификаторНоменклатурыМедицинскихУслуг.Наименование = Номенклатура.Наименование
		|ГДЕ
		|	Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И КлассификаторНоменклатурыМедицинскихУслуг.ЭтоГруппа = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СуществующиеУслуги.ЗагрузитьЗначения(Результат);
	
КонецПроцедуры

&НаКлиенте
// Процедура, отмечает услуги.
//
Процедура ОтметитьУслуги(Установить)
	
	ДанныеДерева = ЭтаФорма._ПодборКлассификаторУслуг.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		ТекущиеДанные = СтрокаТЧ;
		ИмяКолонки 	  = "Выбран";
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки, Установить);
	КонецЦикла;
	
	ТаблицаКлассификаторУслуг.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборКлассификаторУслуг.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Добавить из классификатора на сервере
//
&НаСервереБезКонтекста
Функция ДобавитьИзКлассификатораНаСервере()
	
	СтруктураДанных = Справочники.КлассификаторНоменклатурыМедицинскихУслуг.ЗаполнитьКлассификаторУслуг();
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти
